# Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# Пример:

# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]
list1 = input("Введите числа через пробел: ").split()
for i in range(len(list1)):
    list1[i] = int(list1[i])

list2 = []
i = 0
j = len(list1) - 1
while (i <= j) :
    a = list1[i] * list1[j]
    list2.append(a) 
    i += 1
    j -= 1
print(list2)

