# 1) Напишите программу, которая принимает на вход число N и выдает набор 
# произведений чисел от 1 до N.

# Пример:

# пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)


print('Введите число N: ')
n = int(input())
i = 1
res = 1
j = 0
numbers = list(range(1, n + 1))
numbers[0] = 1
while (i <= n):
    res *= i
    numbers[j] = res
    i += 1
    j += 1
print(numbers)

